#! python3
# -*- coding: utf-8 -*-

from argparse import Namespace

settings = Namespace()

#-------------------------------------------------------------------------------
#全般／共通項目
#-------------------------------------------------------------------------------
DEBUG=True

#-------------------------------------------------------------------------------
#データ部(画面左側)の表示諸元
#-------------------------------------------------------------------------------
COLUMN_NAME  = 0 #未使用
COLUMN_CHART = 4


#-------------------------------------------------------------------------------
#ヘッダ部(画面右上、カレンダ)の表示諸元
#-------------------------------------------------------------------------------

#カレンダ部のY座標を示す添字
CALENDAR_TOP    = 0
CALENDAR_YEAR   = 0
CALENDAR_MONTH  = 1
CALENDAR_DAY    = 2
CALENDAR_BOTTOM = 3

#1日の表示幅
DAY_WIDTH = 24

#ヘッダ部のテキスト描画の際のマージン
CALENDAR_BOTTOM_MARGIN = 3
CALENDAR_LEFT_MARGIN = 0 #未使用。一律センタリング


#-------------------------------------------------------------------------------
#チャート部(画面右下)の表示諸元
#-------------------------------------------------------------------------------

#ガントチャートの線1本の高さ(行高さではない)
CHART_HEIGHT = 10

#ガントチャート内の進捗率の線1本の高さ
PROGRESST_HEIGHT = 6




